package com.example.miseya.data

data class CityArea(
    val city: String,
    val areas: List<String>
)

val cityAreas = listOf(
    CityArea("서울", listOf("강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구", "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중랑구")),
    CityArea("부산", listOf("강서구", "금정구", "남구", "동구", "동래구", "부산진구", "북구", "사상구", "사하구", "서구", "수영구", "연제구", "영도구", "중구", "해운대구")),
    CityArea("대구", listOf("남구", "달서구", "동구", "북구", "서구", "수성구", "중구")),
    CityArea("인천", listOf("계양구", "미추홀구", "남동구", "동구", "부평구", "서구", "연수구", "중구")),
    CityArea("광주", listOf("광산구", "남구", "동구", "북구", "서구")),
    CityArea("대전", listOf("대덕구", "동구", "서구", "유성구", "중구")),
    CityArea("울산", listOf("남구", "동구", "북구", "중구", "울주군")),
    CityArea("세종", listOf("조치원읍", "한솔동", "도담동", "아름동", "종촌동", "고운동", "소담동", "보람동", "대평동")),
    CityArea("경기", listOf("수원시", "성남시", "의정부시", "안양시", "부천시", "광명시", "평택시", "과천시", "오산시", "시흥시", "군포시", "의왕시", "하남시", "용인시", "파주시", "이천시", "안성시", "김포시", "화성시", "광주시", "양주시", "포천시", "여주시")),
    CityArea("강원", listOf("춘천시", "원주시", "강릉시", "동해시", "태백시", "속초시", "삼척시")),
    CityArea("충북", listOf("청주시", "충주시", "제천시")),
    CityArea("충남", listOf("천안시", "공주시", "보령시", "아산시", "서산시", "논산시", "계룡시", "당진시")),
    CityArea("전북", listOf("전주시", "군산시", "익산시", "정읍시", "남원시", "김제시")),
    CityArea("전남", listOf("목포시", "여수시", "순천시", "나주시", "광양시")),
    CityArea("경북", listOf("포항시", "경주시", "김천시", "안동시", "구미시", "영주시", "영천시", "상주시", "문경시", "경산시")),
    CityArea("경남", listOf("창원시", "진주시", "통영시", "사천시", "김해시", "밀양시", "거제시", "양산시")),
    CityArea("제주", listOf("제주시", "서귀포시"))
)
