package com.example.miseya.data

data class CityArea(
    val city: String,
    val areas: List<String>
)

val cityAreas = listOf(
    CityArea(
        "서울", listOf(
            "강남구", "강동구", "강북구", "강서구", "관악구",
            "광진구", "구로구", "금천구", "노원구", "도봉구",
            "동대문구", "동작구", "마포구", "서대문구", "서초구",
            "성동구", "성북구", "송파구", "양천구", "영등포구",
            "용산구", "은평구", "종로구", "중구", "중랑구"
    )),
    CityArea(
        "부산", listOf(
            "광복동", "청학동", "전포동", "초량동", "온천동",
            "명장동", "대연동", "용호동", "학장동", "덕천동",
            "화명동", "삼락동", "좌동", "장림동", "연상동"
        )),
    CityArea(
        "대구", listOf(
            "남산1동", "수창동", "지산동", "서호동", "이현동",
            "대명동", "신암동", "태전동", "산격동", "서변동",
            "연호동", "이곡동", "시지동", "내당동"
        )),
    CityArea(
        "인천", listOf(
            "주안", "부평", "계산", "고잔", "석남",
            "동춘", "운서", "논현", "청라", "인천항",
            "백령도", "연평도", "영종", "구원동"
        )),
    CityArea(
        "광주", listOf(
            "서석동", "농성동", "치평동", "노대동", "유촌동",
            "두암동", "운암동", "건국동", "일곡동", "오선동",
            "주월동"
        )),
    CityArea(
        "대전", listOf(
            "읍내동", "문평동", "문창동", "구성동", "노은동",
            "관평동", "대성동", "둔산동", "월평동"
        )),
    CityArea(
        "울산", listOf(
            "농소동", "약사동", "송정동", "전하동", "대송동",
            "성남동", "야음동", "삼산동", "신정동", "덕신리",
            "효문동"
        )),
    CityArea(
        "세종", listOf(
            "신흥동", "아름동", "한솔동", "보람동", "전의면"
        )),
    CityArea(
        "경기", listOf(
            "가평", "설악면", "양평읍", "연천(DMZ)", "인계동",
            "광교동", "대왕판교로(백현동)", "정자동", "복정동",
            "의정부동", "안양8동", "철산동", "과천동", "평택항",
            "파주", "곤지암", "수지", "기흥", "미사", "남양읍",
            "동탄",
        )),
    CityArea(
        "강원", listOf(
            "중앙동(강원)", "옥천동", "초당동", "천곡동", "남양동1",
            "정선읍", "치악산", "횡성읍", "금호동", "황지동"
            ,"인제읍", "양구읍", "동해항", "철원(DMZ)", "고성(DMZ)"
        )),
    CityArea(
        "충북", listOf(
            "봉명동", "사천동", "용담동", "용암동", "호암동",
            "영천동", "오창읍", "산남동", "오송읍", "단양읍",
            "괴산읍", "음성읍", "옥천읍"
        )),
    CityArea(
        "충남", listOf(
            "백성동", "성성동", "공주", "부여읍", "태안읍",
            "예산군", "홍성읍", "금산읍", "청양읍", "정산면",
            "태안항", "보령항", "서천읍", "논산", "연무읍"
        )),
    CityArea(
        "전북", listOf(
            "삼천동", "옥산면", "여산면", "고창읍", "부안읍",
            "새만금", "진안읍", "임실읍", "무주읍", "안성면",
            "순창읍", "군산항"
        )),
    CityArea(
        "전남", listOf(
            "장흥읍", "진도읍", "함평읍", "고흥읍", "신안군",
            "홍동", "무안읍", "강진읍", "곡성읍", "구례읍",
            "보성읍", "목포항", "여수항", "용당동", "부흥동",
            "서강동", "월내동", "여천동(여수)", "순천만", "담양읍",
            "광양읍", "해남읍", "화순읍", "영광읍"
        )),
    CityArea(
        "경북", listOf(
            "우현동", "장흥동", "송도동", "오천읍", "명륜동",
            "공단동", "원평동", "진미동", "가흥동", "칠곡군",
            "영덕읍", "문경시", "성주군", "영천시", "의성읍",
            "울진군", "울릉읍", "영양군", "예천군",
        )),
    CityArea(
        "경남", listOf(
            "하동읍", "금성면", "삼방동", "진영읍", "사천읍",
            "무전동", "거창읍", "가야읍", "남해읍", "의령읍"
        )),
    CityArea(
        "제주", listOf(
            "연동", "이도동", "조천읍", "한림읍", "애월읍",
            "성산읍", "제주항"
        ))
)